-- --------------------------------------------------------
-- ホスト:                          localhost
-- サーバーのバージョン:                   5.7.35 - MySQL Community Server (GPL)
-- サーバー OS:                      Linux
-- HeidiSQL バージョン:               11.3.0.6295
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- テーブル business_group_type_master: ~14 rows (約) のデータをダンプしています
/*!40000 ALTER TABLE `business_group_type_master` DISABLE KEYS */;
INSERT INTO `business_group_type_master` (`id`, `code`, `title`, `created_at`, `updated_at`, `deleted_at`) VALUES
	(1, 'A', '汎用、多機能に跨る機能', '2022-04-12 05:10:24', NULL, NULL),
	(2, 'B', '新契約', '2022-04-12 05:10:24', NULL, NULL),
	(3, 'C', '保全', '2022-04-12 05:10:24', NULL, NULL),
	(4, 'D', '請求・収納', '2022-04-12 05:10:24', NULL, NULL),
	(5, 'E', '保険金・給付金', '2022-04-12 05:10:24', NULL, NULL),
	(6, 'F', '更新・満了', '2022-04-12 05:10:24', NULL, NULL),
	(7, 'G', '顧客契約照会・顧客照会', '2022-04-12 05:10:24', NULL, NULL),
	(8, 'I', '商品管理', '2022-04-12 05:10:24', NULL, NULL),
	(9, 'J', '代理店・募集人管理', '2022-04-12 05:10:24', NULL, NULL),
	(10, 'K', '再保険', '2022-04-12 05:10:24', NULL, NULL),
	(11, 'L', '数理', '2022-04-12 05:10:24', NULL, NULL),
	(12, 'M', '経理', '2022-04-12 05:10:24', NULL, NULL),
	(13, 'N', '通知送信', '2022-04-12 05:10:24', NULL, NULL),
	(14, 'Z', 'システム管理', '2022-04-12 05:10:24', NULL, NULL);
/*!40000 ALTER TABLE `business_group_type_master` ENABLE KEYS */;

-- テーブル screen_master: ~147 rows (約) のデータをダンプしています
/*!40000 ALTER TABLE `screen_master` DISABLE KEYS */;
INSERT INTO `screen_master` (`id`, `screen_id`, `business_group_type`, `old_screen_id`, `screen_title`, `description`, `created_at`, `updated_at`, `deleted_at`) VALUES
	(1, 'SB001', 'B', '', '新契約申込受付検索', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(2, 'SB002', 'B', '', '新規申込1次査定入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(3, 'SB003', 'B', '', '新規申込1次査定確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(4, 'SB004', 'B', '', '新規申込2次査定入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(5, 'SB005', 'B', '', '新規申込2次査定確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(6, 'SB006', 'B', '', '新規申込査定完了', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(7, 'SB007', 'B', '', '査定結果詳細', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(8, 'SB009', 'B', '', '一括アップロード画面 (新契約)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(9, 'SC001', 'C', '', '保全請求受付入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(10, 'SC002', 'C', '', '保全請求受付確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(11, 'SC003', 'C', '', '保全請求受付完了', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(12, 'SC004', 'C', '', '保全請求受付検索', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(13, 'SC005', 'C', '', '1次査定入力 (払込経路変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(14, 'SC006', 'C', '', '1次査定確認 (払込経路変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(15, 'SC007', 'C', '', '2次査定入力 (払込経路変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(16, 'SC008', 'C', '', '2次査定確認 (払込経路変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(17, 'SC009', 'C', '', '査定完了 (払込経路変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(18, 'SC010', 'C', '', '査定結果詳細 (払込経路変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(19, 'SC011', 'C', '', '1次査定入力 (解約)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(20, 'SC012', 'C', '', '1次査定確認 (解約)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(21, 'SC013', 'C', '', '2次査定入力 (解約)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(22, 'SC014', 'C', '', '2次査定確認 (解約)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(23, 'SC015', 'C', '', '査定完了 (解約)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(24, 'SC016', 'C', '', '査定結果詳細 (解約)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(25, 'SC017', 'C', '', '1次査定入力 (解除)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(26, 'SC018', 'C', '', '1次査定確認 (解除)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(27, 'SC019', 'C', '', '2次査定入力 (解除)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(28, 'SC020', 'C', '', '2次査定確認 (解除)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(29, 'SC021', 'C', '', '査定完了 (解除)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(30, 'SC022', 'C', '', '査定結果詳細 (解除)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(31, 'SC023', 'C', '', '1次査定入力 (名義住所変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(32, 'SC024', 'C', '', '1次査定確認 (名義住所変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(33, 'SC025', 'C', '', '2次査定入力 (名義住所変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(34, 'SC026', 'C', '', '2次査定確認 (名義住所変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(35, 'SC027', 'C', '', '査定完了 (名義住所変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(36, 'SC028', 'C', '', '査定結果詳細 (名義住所変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(37, 'SC029', 'C', '', '1次査定入力 (受取人変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(38, 'SC030', 'C', '', '1次査定確認 (受取人変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(39, 'SC031', 'C', '', '2次査定入力 (受取人変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(40, 'SC032', 'C', '', '2次査定確認 (受取人変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(41, 'SC033', 'C', '', '査定完了 (受取人変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(42, 'SC034', 'C', '', '査定結果詳細 (受取人変更)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(43, 'SD001', 'D', '', '保険料未納契約一覧', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(44, 'SD002', 'D', '', '入金検索', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(45, 'SD003', 'D', '', '入金入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(46, 'SD004', 'D', '', '一括アップロード画面 (入金)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(47, 'SE001', 'E', '', '保険金・給付金請求受付', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(48, 'SE002', 'E', '', '保険金・給付金請求受付入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(49, 'SE003', 'E', '', '保険金・給付金請求受付確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(50, 'SE004', 'E', '', '保険金・給付金請求受付完了', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(51, 'SE005', 'E', '', '保険金・給付金請求検索', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(52, 'SE006', 'E', '', '保険金・給付金1次査定入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(53, 'SE007', 'E', '', '保険金・給付金1次査定確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(54, 'SE008', 'E', '', '保険金・給付金2次査定入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(55, 'SE009', 'E', '', '保険金・給付金2次査定確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(56, 'SE010', 'E', '', '保険金・給付金2次査定完了', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(57, 'SE011', 'E', '', '保険金・給付金査定詳細', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(58, 'SF001', 'F', '', '契約満了申出登録入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(59, 'SF002', 'F', '', '契約満了申出登録確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(60, 'SF003', 'F', '', '契約満了申出登録完了', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(61, 'SG002', 'G', '', '保険契約詳細', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(62, 'SG003', 'G', '', '保険料収納情報', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(63, 'SG004', 'G', '', '支払情報', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(64, 'SG005', 'G', '', '異動履歴詳細', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(65, 'SG006', 'G', '', '顧客検索結果検索', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(66, 'SG007', 'G', '', '顧客詳細表示画面', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(67, 'SJ001', 'J', '', '代理店登録入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(68, 'SJ002', 'J', '', '代理店登録確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(69, 'SJ003', 'J', '', '代理店登録完了', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(70, 'SJ004', 'J', '', '代理店一覧検索', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(71, 'SJ005', 'J', '', '代理店情報変更入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(72, 'SJ006', 'J', '', '代理店情報変更確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(73, 'SJ007', 'J', '', '一括アップロード画面 (支店)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(74, 'SJ008', 'J', '', '支店検索', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(75, 'SJ009', 'J', '', '支店情報変更入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(76, 'SJ010', 'J', '', '支店情報変更確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(77, 'SJ011', 'J', '', '一括アップロード画面 (募集人)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(78, 'SJ012', 'J', '', '募集人一覧検索', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(79, 'SJ013', 'J', '', '募集人情報変更入力', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(80, 'SJ014', 'J', '', '募集人情報変更確認', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(81, 'SM001', 'M', '', 'ダウンロード画面', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(82, 'SO001', 'M', '', 'データ出力 (契約)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(83, 'SO002', 'M', '', 'データ出力 (SBS用)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(84, 'SY001', 'A', '', 'ログイン', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(85, 'SY002', 'A', '', 'メイン', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(86, 'SY003', 'A', '', 'パスワード再設定 (コード送信)', NULL, '2022-09-22 14:05:08', NULL, NULL),
	(87, 'SY004', 'A', '', 'パスワード再設定 (新パスワード設定)', NULL, '2022-09-22 14:05:08', NULL, NULL);
/*!40000 ALTER TABLE `screen_master` ENABLE KEYS */;

-- テーブル screen_region_master: ~23 rows (約) のデータをダンプしています
/*!40000 ALTER TABLE `screen_region_master` DISABLE KEYS */;
INSERT INTO `screen_region_master` (`screen_id`, `screen_region_id`, `screen_region_title`, `description`, `valid`) VALUES
	('SB002','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SB003','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SB004','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SB005','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC005','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC006','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC007','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC008','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC010','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC011','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC012','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC013','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC014','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC016','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC017','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC018','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC019','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC020','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC022','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC023','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC024','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC025','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC026','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC028','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC029','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC030','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC031','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC032','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SC034','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SE002','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SE003','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SE006','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SE007','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SE008','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SE009','INHR_ITM','保障・補償対象情報',NULL,'1')
	,('SG002','INHR_ITM','保障・補償対象情報',NULL,'1');

/*!40000 ALTER TABLE `screen_region_master` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
